{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\andre\OneDrive\UCSD\Research\cgoes\brazil-exports\logs\d01.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Nov 2024, 22:02:07
{txt}
{com}. 
. /// 1. import RAIS dataset
> 
. use "data\rais\RAIS_data_1995_2021_by_municipality_and_CNAE95_5digits.dta", clear
{txt}(RAIS vinculo -1995)

{com}. 
. rename cnae10 cnae10Code
{res}{txt}
{com}. 
. tempfile temp
{txt}
{com}. save `temp'
{txt}{p 0 4 2}
file {bf}
C:\Users\andre\AppData\Local\Temp\ST_a954_000001.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. /// 2. merge with CNAE-ISIC concordance file
> 
. import excel "data\conc\CNAExISIC - EXPORT.xlsx", clear firstrow allstring
{res}{text}(5 vars, 560 obs)

{com}. 
. // check uniqueness
. bysort cnae10Code: gen N = _N
{txt}
{com}. qui sum N
{txt}
{com}. 
. if r(mean) > 1 {c -(}
.         di "non-unique"
.         break   
. {c )-}
{txt}
{com}. 
. drop N
{txt}
{com}. 
. merge 1:m cnae10Code using `temp'
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}         464,886
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}         464,886{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       9,013,551{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. keep if _merge == 3
{txt}(464,886 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. /// 3. rename variables and save processed rais database as a tempfile
>         /// we erase this file at the end of this do-file
> 
. rename contador employment
{res}{txt}
{com}. rename sexo_1 female
{res}{txt}
{com}. rename ano year
{res}{txt}
{com}. rename CÃ³digo_IBGE mun_code_ibge
{res}{txt}
{com}. 
. /// adjust ibge_code
> 
. gen t_ufCode = substr(string(mun_code_ibge),1,2)
{txt}
{com}. destring t_ufCode, gen(ufCode)
{txt}t_ufCode: all characters numeric; ufCode {res}generated {txt}as {res}byte
{txt}(593 missing values generated)
{res}{txt}
{com}. drop t_*
{txt}
{com}. 
. preserve
{txt}
{com}.         collapse (mean) avg_wage_q1 avg_wage_q2 avg_wage_q3 avg_wage_q4, by(year ufCode  mun_code_ibge isic3code3d )
{res}{txt}
{com}.         save "data\temp\means.dta", replace
{txt}{p 0 4 2}
(file {bf}
data\temp\means.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
data\temp\means.dta{rm}
saved
{p_end}

{com}. restore
{txt}
{com}. 
. collapse (sum) employment female less_than_primary primary secondary college_or_higher wage_mass wage_mass_sexo_1 wage_mass_less_than_pri wage_mass_secondary wage_mass_college , by(year ufCode  mun_code_ibge isic3code3d )
{res}{txt}
{com}. 
. merge year ufCode mun_code_ibge isic3code3d using "data\temp\means.dta"
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. erase "data\temp\means.dta"
{txt}
{com}. drop _merge
{txt}
{com}. 
. compress
  {txt}variable {bf}{res}year{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}employment{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}long{sf}
  {txt}variable {bf}{res}female{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}long{sf}
  {txt}variable {bf}{res}less_than_primary{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}long{sf}
  {txt}variable {bf}{res}primary{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}long{sf}
  {txt}variable {bf}{res}secondary{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}long{sf}
  {txt}variable {bf}{res}college_or_higher{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}long{sf}
{txt}  (127,683,270 bytes saved)

{com}. 
. /// 6. save tempfile and close log
> 
. save "data\temp\rais-panel-processed-mun.dta", replace
{txt}{p 0 4 2}
file {bf}
data\temp\rais-panel-processed-mun.dta{rm}
saved
{p_end}

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\andre\OneDrive\UCSD\Research\cgoes\brazil-exports\logs\d01.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 2 Nov 2024, 22:03:12
{txt}{.-}
{smcl}
{txt}{sf}{ul off}