{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\andre\OneDrive\UCSD\Research\cgoes\brazil-exports\logs\d03.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Nov 2024, 22:03:57
{txt}
{com}. 
. /// 1. import quartiles by state, make adjustments, save as tempfiles
> 
. import delimited "data\trade-processed\EXP_quartiles.csv"
{res}{txt}(encoding automatically selected: ISO-8859-1)
{text}(7 vars, 42,399 obs)

{com}. 
. gen co_isic_grupo_str = string(co_isic_grupo)
{txt}
{com}. gen isic3code3d = substr(3 * "0", 1, 3 - length(co_isic_grupo_str)) + co_isic_grupo_str
{txt}
{com}. rename co_ano year
{res}{txt}
{com}. rename sg_uf_ncm uf
{res}{txt}
{com}. drop co_isic_grupo*
{txt}
{com}. 
. // add state codes
. 
. gen ufCode = .
{txt}(42,399 missing values generated)

{com}. 
. replace ufCode = 12 if uf == "AC"
{txt}(663 real changes made)

{com}. replace ufCode = 27 if uf == "AL"
{txt}(833 real changes made)

{com}. replace ufCode = 16 if uf == "AP"
{txt}(552 real changes made)

{com}. replace ufCode = 13 if uf == "AM"
{txt}(1,548 real changes made)

{com}. replace ufCode = 29 if uf == "BA"
{txt}(1,805 real changes made)

{com}. replace ufCode = 23 if uf == "CE"
{txt}(1,716 real changes made)

{com}. replace ufCode = 53 if uf == "DF"
{txt}(1,124 real changes made)

{com}. replace ufCode = 32 if uf == "ES"
{txt}(1,762 real changes made)

{com}. replace ufCode = 52 if uf == "GO"
{txt}(1,662 real changes made)

{com}. replace ufCode = 21 if uf == "MA"
{txt}(890 real changes made)

{com}. replace ufCode = 51 if uf == "MT"
{txt}(1,104 real changes made)

{com}. replace ufCode = 50 if uf == "MS"
{txt}(1,599 real changes made)

{com}. replace ufCode = 31 if uf == "MG"
{txt}(2,148 real changes made)

{com}. replace ufCode = 15 if uf == "PA"
{txt}(1,446 real changes made)

{com}. replace ufCode = 25 if uf == "PB"
{txt}(986 real changes made)

{com}. replace ufCode = 41 if uf == "PR"
{txt}(2,103 real changes made)

{com}. replace ufCode = 26 if uf == "PE"
{txt}(1,679 real changes made)

{com}. replace ufCode = 22 if uf == "PI"
{txt}(610 real changes made)

{com}. replace ufCode = 24 if uf == "RN"
{txt}(1,098 real changes made)

{com}. replace ufCode = 43 if uf == "RS"
{txt}(2,213 real changes made)

{com}. replace ufCode = 33 if uf == "RJ"
{txt}(2,233 real changes made)

{com}. replace ufCode = 11 if uf == "RO"
{txt}(1,059 real changes made)

{com}. replace ufCode = 14 if uf == "RR"
{txt}(678 real changes made)

{com}. replace ufCode = 42 if uf == "SC"
{txt}(2,134 real changes made)

{com}. replace ufCode = 35 if uf == "SP"
{txt}(2,337 real changes made)

{com}. replace ufCode = 28 if uf == "SE"
{txt}(618 real changes made)

{com}. replace ufCode = 17 if uf == "TO"
{txt}(412 real changes made)

{com}. 
. drop if missing(ufCode)
{txt}(5,387 observations deleted)

{com}. 
. /// merge with basefile
> 
. merge 1:m year ufCode isic3code3d using "data\temp\rais-panel-processed-mun.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       4,051,127
{txt}{col 9}from master{col 30}{res}          23,618{txt}  (_merge==1)
{col 9}from using{col 30}{res}       4,027,509{txt}  (_merge==2)

{col 5}Matched{col 30}{res}         883,386{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. /// count employment by tradable quartiles
> 
. gen nonexp = 0
{txt}
{com}. replace nonexp = 1 if q1 == 1 | q2 == 1 | q3 == 1 | q4 == 1  
{txt}(907,004 real changes made)

{com}. keep if _merge > 1
{txt}(23,618 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. collapse (sum) employment, by(year ufCode mun_code_ibge nonexp)
{res}{txt}
{com}. 
. reshape wide employment, i(year ufCode mun_code_ibge) j(nonexp)
{txt}(j = 0 1)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}     271,440   {txt}->   {res}148,133     
{txt}Number of variables        {res}           5   {txt}->   {res}5           
{txt}j variable (2 values)            {res}nonexp   {txt}->   (dropped)
xij variables:
                             {res}employment   {txt}->   {res}employment0 employment1
{txt}{hline 77}

{com}. 
. rename employment0 emp_ntrade
{res}{txt}
{com}. rename employment1 emp_trade
{res}{txt}
{com}. replace emp_trade = 0 if !missing(emp_trade)
{txt}(123,345 real changes made)

{com}. 
. merge 1:1 year ufCode mun_code_ibge using "data\temp\mun-trade-panel-processed.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               6
{txt}{col 9}from master{col 30}{res}               6{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}         148,127{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge == 3
{txt}(6 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. drop if missing(mun_code_ibge)
{txt}(0 observations deleted)

{com}. 
. save "data\temp\mun-trade-panel-processed.dta", replace
{txt}{p 0 4 2}
file {bf}
data\temp\mun-trade-panel-processed.dta{rm}
saved
{p_end}

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\andre\OneDrive\UCSD\Research\cgoes\brazil-exports\logs\d03.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 2 Nov 2024, 22:04:01
{txt}{.-}
{smcl}
{txt}{sf}{ul off}